app/views/static_pages/carts_index.html.erb

SELECT "carts".* FROM "carts"
---
    <div class ="center">
    <%@carts = Cart.all%>

SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 ORDER BY "articulos"."created_at" DESC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    <% if cart.user_id == current_user.id %>
    <% @articulo = Articulo.find(cart.articulo_id) %>