app/views/static_pages/carts_index.html.erb

    <h3 class="page-title">Items en el carrito</h3></div>
    <%@carts = Cart.where(user_id: current_user.id)%>
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 4]]