app/views/comentarios/_comentario.html.erb

<div class="content">
   <%@usuario = User.find_by(id: comentario.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]