app/views/comentarios/destroy.js.erb

DELETE FROM "comentarios" WHERE "comentarios"."id" = $1  [["id", 18]]
---
$('.delete_comentario').bind('ajax:success', function() {
   $(this).closest('div.content').fadeOut();
});