app/views/shared/_articulos_index.html.erb

SELECT "articulos".* FROM "articulos" ORDER BY "articulos"."created_at" DESC
SELECT "articulos".* FROM "articulos" WHERE "articulos"."categoria" = $1 ORDER BY "articulos"."created_at" DESC  [["categoria", "tecnologia"]]
---
<% if categoria == '' %>
<%@articulos = Articulo.all%>
<%  else  %>
<%@articulos = Articulo.where(categoria: categoria)%>