app/views/shared/_carts_index.html.erb


  <%@carts = Cart.all%>
---
SELECT "carts".* FROM "carts"

  <% if cart.user_id == current_user.id %>
  <% @articulo = Articulo.find(cart.articulo_id) %>
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 ORDER BY "articulos"."created_at" DESC LIMIT $2  [["id", 6], ["LIMIT", 1]]