app/controllers/articulos_controller.rb

  def index
    @articulos = Articulo.all
---
SELECT "articulos".* FROM "articulos" WHERE (nombre LIKE '%coyar%') ORDER BY "articulos"."created_at" DESC, created_at DESC

  def create
    @articulo = current_user.articulos.build(articulo_params)
    if @articulo.save!
---
INSERT INTO "articulos" ("user_id", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["descripcion", "Nuevo pc "], ["created_at", 2017-05-14 02:16:55 UTC], ["updated_at", 2017-05-14 02:16:55 UTC]]

  def update
    respond_to do |format|
      if @articulo.update(articulo_params)
---
UPDATE "articulos" SET "categoria" = $1, "image" = $2, "updated_at" = $3 WHERE "articulos"."id" = $4  [["categoria", "tecnologia"], ["image", "MACBOOKAIR.jpeg"], ["updated_at", 2017-06-01 18:45:25 UTC], ["id", 9]]

  def destroy
    destroy_cart_entries
    destroy_comments

    if @articulo.destroy!
---
DELETE FROM "articulos" WHERE "articulos"."id" = $1  [["id", 6]]

    def set_articulo
      @articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 ORDER BY "articulos"."created_at" DESC LIMIT $2  [["id", 9], ["LIMIT", 1]]