app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)
    if @cart.save!
---
INSERT INTO "carts" ("cantidad", "user_id", "articulo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cantidad", 1], ["user_id", 5], ["articulo_id", 6], ["created_at", 2017-05-15 02:02:11 UTC], ["updated_at", 2017-05-15 02:02:11 UTC]]

  def destroy
    Cart.find_by(id:params[:id]).destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 8]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]