app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
---
SELECT "comentarios".* FROM "comentarios"

  def create
    @comentario = Comentario.new(comentario_params)
    if @comentario.save!
---
INSERT INTO "comentarios" ("user_id", "articulo_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "22"], ["articulo_id", "14"], ["content", "Chuta"], ["created_at", 2017-05-28 00:53:46 UTC], ["updated_at", 2017-05-28 00:53:46 UTC]]

  def destroy
    @comentario.destroy!
---
DELETE FROM "comentarios" WHERE "comentarios"."id" = $1  [["id", 18]]

    def set_comentario
      @comentario = Comentario.find(params[:id])
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]