app/controllers/password_resets_controller.rb

  def update
      if params[:user][:password].empty?                  # Case (3)
        @user.errors.add(:password, "can't be empty")
        render 'edit'
      elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$gWQPEFxSN/.Sax7.SO0SaegkkOcMLPcE9ON8KLa9kn0i.ijTpEE7a"], ["updated_at", 2017-05-27 04:57:00 UTC], ["id", 22]]