app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Christian Ackermann"], ["email", "caackermann@uc.cl"], ["created_at", 2017-04-30 22:18:24 UTC], ["updated_at", 2017-04-30 22:18:24 UTC], ["password", "783554"]]