app/views/articulos/destroy.js.erb

$('.delete_articulo').bind('ajax:success', function() {
   $(this).closest('.catCardList').fadeOut();
});
---
DELETE FROM "articulos" WHERE "articulos"."id" = $1  [["id", 11]]