app/views/articulos/show.html.erb


        <%@comentarios = Comentario.where(articulo_id:@articulo.id)%>
---
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = $1  [["articulo_id", "12"]]

            <% @comentarios.each do |comentario|%>
              <%@usuario = User.find_by(id: comentario.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = $1 LIMIT $2  [["user_id", "22"], ["LIMIT", 1]]